{
  "parameters": [
    {
      "name": "Time",
      "type": "isotime",
      "length": 24
    },
    {
      "name": "Bx_VSO",
      "type": "double",
      "units": "nT",
      "description": "Bx VSO: The X-component of the magnetic field in the Venus Solar Orbital System (VSO - GSE at Venus). The system is Venus centered, with the X axis pointing instantaneously from Venus to the Sun, the Z axis is perpendicular to the orbital (ecliptic) plane of Venus positive 'up', and the Y axis completing the right-handed set.",
      "size": [
        1
      ]
    },
    {
      "name": "By_VSO",
      "type": "double",
      "units": "nT",
      "description": "By VSO: The Y-component of the magnetic field in the Venus Solar Orbital System (VSO).",
      "size": [
        1
      ]
    },
    {
      "name": "Bz_VSO",
      "type": "double",
      "units": "nT",
      "description": "BZ VSO: The Z-component of the magnetic field in the Venus Solar Orbital System (VSO).",
      "size": [
        1
      ]
    },
    {
      "name": "Bx_SC",
      "type": "double",
      "units": "nT",
      "description": "Bx SC: The X-component of the magnetic field in the PVO Inertial Spacecraft Coordinate System (PVO_ISCC). This is the component that lies in the sunward direction in the plane that contains the Sun-spacecraft vector and the spacecraft spin axis. This vector has been averaged over two spin periods from the high resolution data.",
      "size": [
        1
      ]
    },
    {
      "name": "By_SC",
      "type": "double",
      "units": "nT",
      "description": "By SC: The Y-component of the magnetic field in the PVO Inertial Spacecraft Coordinate System (PVO_ISCC). The Y axis is formed by the right-handed vector cross product of the X and Z unit vectors where the Z axis is anti-parallel to the spacecraft spin axis and the X-Z plane contains the Sun. This vector has been averaged over two spin periods from the high resolution data.",
      "size": [
        1
      ]
    },
    {
      "name": "Bz_SC",
      "type": "double",
      "units": "nT",
      "description": "Bz SC: The Z-component of the magnetic field in the PVO Inertial Spacecraft Coordinate System (PVO_ISCC). The Z axis is defined to be anti-parallel to the spacecraft spin axis during orbital operations. This vector has been averaged over two spin periods from the high resolution data.",
      "size": [
        1
      ]
    },
    {
      "name": "Bt",
      "type": "double",
      "units": "nT",
      "description": "Bt: The vector magnitude of the averaged field components.",
      "size": [
        1
      ]
    },
    {
      "name": "VAR_Bx",
      "type": "double",
      "units": "nT**2",
      "description": "VAR Bx: Variance of the Bx SC over the averaging window.",
      "size": [
        1
      ]
    },
    {
      "name": "CVAR_Bxy",
      "type": "double",
      "units": "nT**2",
      "description": "CVAR Bxy: The covariance of Bx SC wrt By SC over the averaging window.",
      "size": [
        1
      ]
    },
    {
      "name": "CVAR_BZ",
      "type": "double",
      "units": "nT**2",
      "description": "CVAR Bxz: The covariance of Bx SC wrt Bz SC over the averaging window.",
      "size": [
        1
      ]
    },
    {
      "name": "VAR_By",
      "type": "double",
      "units": "nT**2",
      "description": "VAR By: Variance of the By SC over the averaging window.",
      "size": [
        1
      ]
    },
    {
      "name": "CVAR_Byz",
      "type": "double",
      "units": "nT**2",
      "description": "CVAR_Byz: The covariance of By SC wrt Bz SC over the averaging window.",
      "size": [
        1
      ]
    },
    {
      "name": "VAR_Bz",
      "type": "double",
      "units": "nT**2",
      "description": "VAR Bz: Variance of the Bz SC over the averaging window.",
      "size": [
        1
      ]
    },
    {
      "name": "VAR_Bt",
      "type": "double",
      "units": "nT**2",
      "description": "VAR Bt: Variance of the Bt SC over the averaging window.",
      "size": [
        1
      ]
    },
    {
      "name": "N",
      "type": "integer",
      "units": "N/A",
      "description": "N: The number of data points in the magnetic field averages.",
      "size": [
        1
      ]
    },
    {
      "name": "X_VSO",
      "type": "double",
      "units": "Venus radii",
      "description": "X VSO: The X-component of the PVO spacecraft position in Venus Solar Orbital Coordinates (VSO). The X component of the VSO coordinate system is taken to be positive in the direction of the Sun measured along the Venus- Sun line. The units are given in Venus Radii where Rv = 6050 km.",
      "size": [
        1
      ]
    },
    {
      "name": "Y_VSO",
      "type": "double",
      "units": "Venus radii",
      "description": "Y VSO: The Y-component of the PVO spacecraft position in Venus Solar Orbital Coordinates (VSO).The Y component of the VSO coordinate system is taken to be positive in the direction opposing orbital motion (dusk) and lying in the orbital plane of Venus. The units given in Venus Radii where Rv = 6050 km.",
      "size": [
        1
      ]
    },
    {
      "name": "Z_VSO",
      "type": "double",
      "units": "Venus radii",
      "description": "Z VSO: The Z-component of the PVO spacecraft position in Venus Solar Orbital Coordinates (VSO). The Z component of the VSO coordinate system is taken to be parallel to the pole of the Venus orbital plane and positive in the northward direction (upward normal).  The units are given in Venus Radii where Rv = 6050 km.",
      "size": [
        1
      ]
    },
    {
      "name": "ALT",
      "type": "double",
      "units": "km",
      "description": "ALT: Spacecraft Altitude above the Venus surface. This value is computed by subtracting 6050 km from the centered Venus-to-PVO range given in the SEDR.",
      "size": [
        1
      ]
    },
    {
      "name": "SZA",
      "type": "double",
      "units": "degree",
      "description": "SZA: Solar Zenith Angle. This is the three body angle Sun-Venus-PVO taken from the SEDR.",
      "size": [
        1
      ]
    },
    {
      "name": "LON",
      "type": "double",
      "units": "degree",
      "description": "LON: Venus centered longitude of the PVO spacecraft.",
      "size": [
        1
      ]
    },
    {
      "name": "LAT",
      "type": "double",
      "units": "degree",
      "description": "LAT: Venus centered latitude of the PVO spacecraft.",
      "size": [
        1
      ]
    }
  ],
  "description": "",
  "startDate": "",
  "stopDate": "",
  "_meta": {
    "source": "label"
  }
}
